[
    {
        "user": "frank woodford",
        "rating": 2,
        "comment": "My experience was very good with Abu Ashraf as he made me feel very comfortable which allowed me to pass today, thank you Abu Ashraf"
    },
    {
        "user": "khadija Guebli",
        "rating": 5,
        "comment": "i passed for the first time today!\n\ni had been learning with abu ashraf for a total of 6 months and they were probably the best months ever! abu ensured that every single lesson we had together was full of laughter but also seriousness, a good balance of the two resulted with our lessons never being boring.\n\nabu always remained patient and made sure i always understood what he would teach me and if i didn’t understand something he would go over it again until i did. i also had a few gaps whilst i was learning how to drive as i went on holiday and i’m currently at university so i’ve moved away.\n\ni had a 3 week nearly 4 week gap but i did back to back lessons for 4 days straight with abu and it was more than enough for me to pass! abu ashraf is an amazing instructor who will definitely secure you a straight pass."
    },
    {
        "user": "Adekunle David Afolabi",
        "rating": 5,
        "comment": "I’m David Afolabi and I took my driving lessons with Abu Ashraf. All I can say is that he’s the best tutor in the UK. He’s so patient and teaches you like you are a five year old. He took me round all test routes and he was just the best.\n\nI passed my driving test at one go with just minor fault. My wife equally passed her test with him with one minor fault. If you are looking for an instructor who is well detailed and pays attention to details then Abu Ashraf is you go to person. 5 star rating for him."
    },
    {
        "user": "Tam Nguyen",
        "rating": 5,
        "comment": "I passed my driving test, with Abu Ashraf as my instructor. This is my first attempt at driving test.\n\nI strongly recommend him for anyone looking for driving lessons. I came to Ashraf about 5 months before my test. I tried a few instructors before, but they made me feel quite unsafe and I was not learning anything properly, so I stopped my lessons with them. On my first day with Ashraf, he immediately proved himself as a knowledgeable, pedagogical, and dedicated instructor.\n\nI was very impressed. Then for 5 months we took lessons, twice a week and more frequently in the leadup to my test. He walked me through everything, explaining everything carefully and offering a lot of encouragement along the way. I will miss Abu Ashraf a lot in the future when I will be driving my own car, without him sitting next to me. He has prepared me for a lifetime of safe driving, for which I cannot thank him enough!"
    },
    {
        "user": "aregbesola olayinka",
        "rating": 5,
        "comment": "I took my Driving lessons with Abu Ashraf 17 hours in total and he was just too good. He took me through all the test routes within St Albans and one of the test routes he reviewed with me 20mins before the test was the one taken by the examiner.\n\nHe explains the rules to you like he explaining to a 5 years old just to ensure you understand them .I just too happy now.I passed the the test on my first attempt!!"
    },
    {
        "user": "Elisabeth Barrow",
        "rating": 5,
        "comment": "Massive thanks to Abu Ashraf. With his patience and passion for his students helped me pass my driving test, the 1st time. I would 100% recommend Abu if you want someone that goes the extra mile for great results."
    }
]